# Exercise 4.9 - Part 1

## Importing Libraries and the customer data set

Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

Importing the customer data set using a path

In [2]:
path = r'C:\Users\chris\Desktop\Upskilling\CareerFoundry\Data Immersion\Achievement 4\08-2025 Instacart Basket Analysis'

In [3]:
df_cust = pd.read_csv(os.path.join(path, '02. Data', 'Original Data', 'customers.csv'))

## Wrangling the Dataframe

Checking the shape of the dataset

In [4]:
df_cust.head(1000)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
995,157936,Nicholas,Gross,Male,Rhode Island,52,1/6/2017,2,married,147933
996,21309,Ernest,Arias,Male,South Dakota,64,1/6/2017,1,married,143108
997,82291,Frank,Callahan,Male,North Carolina,49,1/6/2017,1,married,135887
998,77675,Frank,Lloyd,Male,Alaska,71,1/6/2017,1,married,92629
999,200662,Margaret,Hale,Female,North Carolina,72,1/6/2017,0,divorced/widowed,88404

Checking for duplicated records

In [5]:
df_dups = df_cust[df_cust.duplicated()]

In [6]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surnam, Gender, STATE, Age, date_joined, n_dependants, fam_status, income]
Index: []

Checking the key statistical info

In [7]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

Removing unnecessary columns - First name and Surnam

In [8]:
df_cust.drop(columns = ['Surnam', 'First Name'])

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...
206204,168073,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Female,California,27,4/1/2020,1,married,99799
206208,80148,Female,New York,55,4/1/2020,1,married,57095

In [9]:
df_cust = df_cust.drop(columns = ['Surnam', 'First Name'])

In [10]:
df_cust = df_cust.drop(columns = ['date_joined'])

Renaming columns - State and Number_Dependents

In [11]:
df_cust.rename(columns = {'STATE' : 'State'}, inplace = True)

In [12]:
df_cust.rename(columns = {'n_dependents' : 'number_dependents'}, inplace = True)

In [13]:
df_cust.head()

   user_id  Gender       State  Age  n_dependants fam_status  income
0    26711  Female    Missouri   48             3    married  165665
1    33890  Female  New Mexico   36             0     single   59285
2    65803    Male       Idaho   35             2    married   99568
3   125935  Female        Iowa   40             0     single   42049
4   130797  Female    Maryland   26             1    married   40374

Checking data types

In [14]:
df_cust.dtypes

user_id          int64
Gender          object
State           object
Age              int64
n_dependants     int64
fam_status      object
income           int64
dtype: object

reducing data type size

In [15]:
df_cust['user_id'] = df_cust['user_id'].astype('int32')

In [16]:
df_cust.dtypes

user_id          int32
Gender          object
State           object
Age              int64
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [17]:
df_cust[['Age', 'n_dependants']] = df_cust[['Age', 'n_dependants']].astype('int16')

In [18]:
df_cust.dtypes

user_id          int32
Gender          object
State           object
Age              int16
n_dependants     int16
fam_status      object
income           int64
dtype: object

## Checking for consistency

Checking for mixed data types

In [19]:
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

Checking for missing values

In [20]:
df_cust.isnull().sum()

user_id         0
Gender          0
State           0
Age             0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [21]:
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

Exporting customer dataframe

In [22]:
df_cust.to_csv(os.path.join(path, '02. Data','Prepared Data', 'customers.csv'))

In [23]:
df_ords_prods = pd.read_pickle(os.path.join(path, '02. Data', 'Prepared Data', 'order_products_agg_variables.pkl'))

In [24]:
df_ords_prods.dtypes

order_id                            int32
user_id                             int32
order_number                         int8
orders_day_of_week                   int8
order_hour_of_day                    int8
days_since_prior_order            float64
first_order                        object
product_id                          int32
add_to_cart_order                   int16
reordered                            int8
product_name                       object
department_id                     float64
_merge                           category
meat_eater                         object
prices                            float64
_merge_prices                    category
price_range_loc                    object
busiest_days                       object
busiest_period_of_day              object
max_order                            int8
loyalty_flag                       object
avg_product_price                 float64
spend_flag                         object
median_days_since_prior_order     float64
frequency_flag                     object
dtype: object

In [25]:
int_columns = df_ords_prods.select_dtypes(include=['int']).columns
df_ords_prods[int_columns] = df_ords_prods[int_columns].apply(pd.to_numeric, downcast='integer')

In [26]:
int_columns = df_cust.select_dtypes(include=['int']).columns
df_cust[int_columns] = df_cust[int_columns].apply(pd.to_numeric, downcast='integer')

In [27]:
df_ords_prods.dtypes

order_id                            int32
user_id                             int32
order_number                         int8
orders_day_of_week                   int8
order_hour_of_day                    int8
days_since_prior_order            float64
first_order                        object
product_id                          int32
add_to_cart_order                   int16
reordered                            int8
product_name                       object
department_id                     float64
_merge                           category
meat_eater                         object
prices                            float64
_merge_prices                    category
price_range_loc                    object
busiest_days                       object
busiest_period_of_day              object
max_order                            int8
loyalty_flag                       object
avg_product_price                 float64
spend_flag                         object
median_days_since_prior_order     float64
frequency_flag                     object
dtype: object

In [28]:
df_cust.dtypes

user_id          int32
Gender          object
State           object
Age              int16
n_dependants     int16
fam_status      object
income           int32
dtype: object

In [29]:
df_ords_prods_custs = df_ords_prods.merge(df_cust, on = 'user_id', how = "left", indicator = '_merge_customers')

In [30]:
df_ords_prods_custs.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,spend_flag,median_days_since_prior_order,frequency_flag,Gender,State,Age,n_dependants,fam_status,income,_merge_customers
0,2539329,1,1,2,8,0.0,yes,196,1,0,...,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423,both
1,2539329,1,1,2,8,0.0,yes,14084,2,0,...,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423,both
2,2539329,1,1,2,8,0.0,yes,12427,3,0,...,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423,both
3,2539329,1,1,2,8,0.0,yes,26088,4,0,...,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423,both
4,2539329,1,1,2,8,0.0,yes,26405,5,0,...,Low spender,20.0,Regular customer,Female,Alabama,31,3,married,40423,both

In [31]:
df_ords_prods_custs.to_pickle(os.path.join(path, '02. Data','Prepared Data', 'order_products_customers.pkl'))